In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df[['Parch','Cabin']]

     Parch Cabin
0        0   NaN
1        0   C85
2        0   NaN
3        0  C123
4        0   NaN
..     ...   ...
886      0   NaN
887      0   B42
888      2   NaN
889      0  C148
890      0   NaN

[891 rows x 2 columns]

In [7]:
#first five rows 
df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
#first two columns with first 3 rows
df.iloc[:3,:2]

   PassengerId  Survived
0            1         0
1            2         1
2            3         1

In [10]:
df[df['Pclass']== 3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
df1 = pd.read_csv("bigmart_data.csv")
df1 = df1.dropna(how='any')
df1.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
4,NCD19,8.930,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
5,FDP36,10.395,Regular,0.000000,Baking Goods,51.4008,OUT018,2009,Medium,Tier 3,Supermarket Type2,556.6088

Sorting dataframes
sort_values(): by one or more columns
sort_index(): by row index

In [5]:
sortbyyear = df1.sort_values(by='Outlet_Establishment_Year')
sortbyyear.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
2812,FDR60,14.30,Low Fat,0.130307,Baking Goods,75.7328,OUT013,1987,High,Tier 3,Supermarket Type1,617.8624
5938,NCJ06,20.10,Low Fat,0.034624,Household,118.9782,OUT013,1987,High,Tier 3,Supermarket Type1,1549.3166
3867,FDY38,13.60,Regular,0.119077,Dairy,231.2300,OUT013,1987,High,Tier 3,Supermarket Type1,2330.3000
1307,FDB37,20.25,Regular,0.022922,Baking Goods,240.7538,OUT013,1987,High,Tier 3,Supermarket Type1,3364.9532
5930,NCA18,10.10,Low Fat,0.056031,Household,115.1492,OUT013,1987,High,Tier 3,Supermarket Type1,1737.7380

In [7]:
#inplace: whther thw changes should get reflected in the original datbase
#ascending:asc or desc
sortbyyear_sales = df1.sort_values(by=['Outlet_Establishment_Year','Item_Outlet_Sales'], ascending=True)

sortbyyear_sales.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
2370,NCA06,20.500,Low Fat,0.143164,Household,34.9190,OUT013,1987,High,Tier 3,Supermarket Type1,73.2380
4174,FDI60,7.220,Regular,0.038289,Baking Goods,64.7510,OUT013,1987,High,Tier 3,Supermarket Type1,126.5020
2244,FDZ27,7.935,LF,0.017142,Dairy,50.0350,OUT013,1987,High,Tier 3,Supermarket Type1,149.8050
3684,FDV38,19.250,Low Fat,0.101689,Dairy,54.6956,OUT013,1987,High,Tier 3,Supermarket Type1,163.7868
1209,FDU21,11.800,reg,0.076657,Snack Foods,32.3558,OUT013,1987,High,Tier 3,Supermarket Type1,169.7790

Merging Dataframes
concat(): row-wise combine
merge(): based on column columns
join='outer': outer join of 2 df(s)
join='inner': inner join of 2 df(s)

In [2]:
df2 = pd.DataFrame({'A':[1,2,3,4],
'B': [5,6,7,8]})
df3 = pd.DataFrame({'A':[9,12,13,14],
'B': [15,16,17,18]})
df4 = pd.concat([df2,df3], keys=['x','y'])
df4

      A   B
x 0   1   5
  1   2   6
  2   3   7
  3   4   8
y 0   9  15
  1  12  16
  2  13  17
  3  14  18

In [17]:
df4.loc['y']  #not iloc but use loc to index by non-integer keys

    A   B
0   9  15
1  12  16
2  13  17
3  14  18

In [3]:
#left join
pd.merge(df2,df3,on='A',how='left')

   A  B_x  B_y
0  1    5  NaN
1  2    6  NaN
2  3    7  NaN
3  4    8  NaN

Apply function instead of for loops

In [7]:
#access daatset rowwise 
#access first row
df1.apply(lambda x: x[0])

Item_Identifier                          FDA15
Item_Weight                                9.3
Item_Fat_Content                       Low Fat
Item_Visibility                      0.0160473
Item_Type                                Dairy
Item_MRP                               249.809
Outlet_Identifier                       OUT049
Outlet_Establishment_Year                 1999
Outlet_Size                             Medium
Outlet_Location_Type                    Tier 1
Outlet_Type                  Supermarket Type1
Item_Outlet_Sales                      3735.14
dtype: object

In [8]:
#access first column by index
df1.apply(lambda x: x[0], axis=1)

0       FDA15
1       DRC01
2       FDN15
4       NCD19
5       FDP36
        ...
8517    FDF53
8518    FDF22
8520    NCJ29
8521    FDN46
8522    DRG01
Length: 4650, dtype: object

In [9]:
#using columns
df1.apply(lambda x: x['Item_Fat_Content'],axis=1)

0       Low Fat
1       Regular
2       Low Fat
4       Low Fat
5       Regular
         ...
8517        reg
8518    Low Fat
8520    Low Fat
8521    Regular
8522    Low Fat
Length: 4650, dtype: object

In [11]:
#df1['Item_MRP'][:5]
#clip first 5 item MRPs to 200 if MRP >200
def clipPrice(price):
    if price>200:
        price = 200
    return price

df1['Item_MRP'].apply(lambda x: clipPrice(x))[:5]

0    200.0000
1     48.2692
2    141.6180
4     53.8614
5     51.4008
Name: Item_MRP, dtype: float64

In [14]:
def city_encode(city):
    if city == 'Tier 1':
        label = 0
    if city == 'Tier 2':
        label = 1
    else:
        label = 2
    return label

df1['Outlet_Location_Type'].apply(lambda x: city_encode(x))

0       2
1       2
2       2
4       2
5       2
       ..
8517    2
8518    2
8520    1
8521    2
8522    2
Name: Outlet_Location_Type, Length: 4650, dtype: int64

Aggregating data:
1. groupby: batches/buckets
2. pivottable
3. crosstab

In [5]:
pricebyitem = df1.groupby('Item_Type')

In [7]:
pricebyitem.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
4,NCD19,8.930,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
5,FDP36,10.395,Regular,0.000000,Baking Goods,51.4008,OUT018,2009,Medium,Tier 3,Supermarket Type2,556.6088
...,...,...,...,...,...,...,...,...,...,...,...,...
716,FDG21,17.350,Regular,0.146896,Seafood,149.6050,OUT018,2009,Medium,Tier 3,Supermarket Type2,3745.1250
812,FDO13,7.865,Low Fat,0.061009,Breakfast,166.0526,OUT013,1987,High,Tier 3,Supermarket Type1,3617.9572
866,FDJ57,7.420,Regular,0.021570,Seafood,184.8582,OUT035,2004,Small,Tier 2,Supermarket Type1,4643.9550
1006,FDI57,19.850,Low Fat,0.053981,Seafood,196.8768,OUT013,1987,High,Tier 3,Supermarket Type1,2561.9984
1884,FDH09,12.600,Low Fat,0.056067,Seafood,50.7982,OUT035,2004,Small,Tier 2,Supermarket Type1,473.3838

In [8]:
pricebyitem.Item_MRP.mean()

Item_Type
Baking Goods             125.795653
Breads                   141.300639
Breakfast                134.090683
Canned                   138.551179
Dairy                    149.481471
Frozen Foods             140.095830
Fruits and Vegetables    145.418257
Hard Drinks              140.102908
Health and Hygiene       131.437324
Household                149.884244
Meat                     140.279344
Others                   137.640870
Seafood                  146.595782
Snack Foods              147.569955
Soft Drinks              130.910182
Starchy Foods            151.256747
Name: Item_MRP, dtype: float64

In [9]:
#multiple groups
multiGroup = df1.groupby(['Item_Type','Item_Fat_Content'])
multiGroup.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
4,NCD19,8.930,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
5,FDP36,10.395,Regular,0.000000,Baking Goods,51.4008,OUT018,2009,Medium,Tier 3,Supermarket Type2,556.6088
...,...,...,...,...,...,...,...,...,...,...,...,...
7712,FDR15,9.300,reg,0.033490,Meat,156.6314,OUT049,1999,Medium,Tier 1,Supermarket Type1,1241.0512
7792,FDV47,17.100,low fat,0.054162,Breads,85.3566,OUT013,1987,High,Tier 3,Supermarket Type1,1775.6886
7944,FDO49,10.600,reg,0.033052,Breakfast,49.7008,OUT046,1997,Small,Tier 1,Supermarket Type1,961.4152
8068,NCU53,5.485,low fat,0.042744,Health and Hygiene,166.2842,OUT035,2004,Small,Tier 2,Supermarket Type1,1989.4104
8379,FDV39,11.300,LF,0.007280,Meat,199.3426,OUT046,1997,Small,Tier 1,Supermarket Type1,2372.9112

In [10]:
#outlet sizes based on ity type
pd.crosstab(df1['Outlet_Size'],df1['Outlet_Location_Type'],margins=True)

Outlet_Location_Type  Tier 1  Tier 2  Tier 3   All
Outlet_Size
High                       0       0     932   932
Medium                   930       0     928  1858
Small                    930     930       0  1860
All                     1860     930    1860  4650

In [13]:
#how are the sales changing per year
pd.pivot_table(data=df1,index=['Outlet_Establishment_Year'],values=['Item_Outlet_Sales'])

                           Item_Outlet_Sales
Outlet_Establishment_Year
1987                             2298.995256
1997                             2277.844267
1999                             2348.354635
2004                             2438.841866
2009                             1995.498739

In [14]:
#multiple
pd.pivot_table(data=df1,index=['Outlet_Establishment_Year','Outlet_Location_Type','Outlet_Size'],values=['Item_Outlet_Sales'])

                                                            Item_Outlet_Sales
Outlet_Establishment_Year Outlet_Location_Type Outlet_Size
1987                      Tier 3               High               2298.995256
1997                      Tier 1               Small              2277.844267
1999                      Tier 1               Medium             2348.354635
2004                      Tier 2               Small              2438.841866
2009                      Tier 3               Medium             1995.498739